alibaba/AliOS-Things/platform/mcu/lpc54102/drivers/fsl_clock.h
/*! @brief PLL status definitions
 */
typedef enum _pll_error
{
    kStatus_PLL_Success = MAKE_STATUS(kStatusGroup_Generic, 0),        /*!< PLL operation was successful */
    kStatus_PLL_OutputTooLow = MAKE_STATUS(kStatusGroup_Generic, 1),   /*!< PLL output rate request was too low */
    kStatus_PLL_OutputTooHigh = MAKE_STATUS(kStatusGroup_Generic, 2),  /*!< PLL output rate request was too high */
    kStatus_PLL_InputTooLow = MAKE_STATUS(kStatusGroup_Generic, 3),    /*!< PLL input rate is too low */
    kStatus_PLL_InputTooHigh = MAKE_STATUS(kStatusGroup_Generic, 4),   /*!< PLL input rate is too high */
    kStatus_PLL_OutsideIntLimit = MAKE_STATUS(kStatusGroup_Generic, 5) /*!< Requested output rate isn't possible */
} pll_error_t;

/*! @brief	Return System PLL output clock rate from setup structure
 *  @param	pSetup	: Pointer to a PLL setup structure
 *  @return	System PLL output clock rate calculated from the setup structure
 */
uint32_t CLOCK_GetSystemPLLOutFromSetup(pll_setup_t *pSetup);

/*! @brief	Set PLL output based on the passed PLL setup data
 *  @param	pControl	: Pointer to populated PLL control structure to generate setup with
 *  @param	pSetup		: Pointer to PLL setup structure to be filled
 *  @return	PLL_ERROR_SUCCESS on success, or PLL setup error code
 *  @note	Actual frequency for setup may vary from the desired frequency based on the
 *  accuracy of input clocks, rounding, non-fractional PLL mode, etc.
 */
pll_error_t CLOCK_SetupPLLData(pll_config_t *pControl, pll_setup_t *pSetup);

/*! @brief	Set PLL output from PLL setup structure (precise frequency)
 *  @param	pSetup	: Pointer to populated PLL setup structure
 *  @param  flagcfg : Flag configuration for PLL config structure
 *  @return	PLL_ERROR_SUCCESS on success, or PLL setup error code
 *  @note	This function will power off the PLL, setup the PLL with the
 *  new setup data, and then optionally powerup the PLL, wait for PLL lock,
 *  and adjust system voltages to the new PLL rate. The function will not
 *  alter any source clocks (ie, main systen clock) that may use the PLL,
 *  so these should be setup prior to and after exiting the function.
 */
pll_error_t CLOCK_SetupSystemPLLPrec(pll_setup_t *pSetup, uint32_t flagcfg);

/*! @brief	Set PLL output from PLL setup structure (precise frequency)
 *  @param	pSetup	: Pointer to populated PLL setup structure
 *  @return	kStatus_PLL_Success on success, or PLL setup error code
 *  @note	This function will power off the PLL, setup the PLL with the
 *  new setup data, and then optionally powerup the PLL, wait for PLL lock,
 *  and adjust system voltages to the new PLL rate. The function will not
 *  alter any source clocks (ie, main systen clock) that may use the PLL,
 *  so these should be setup prior to and after exiting the function.
 */
pll_error_t CLOCK_SetPLLFreq(const pll_setup_t *pSetup);

/*! @brief	Set PLL output based on the multiplier and input frequency
 *  @param	multiply_by	: multiplier
 *  @param	input_freq	: Clock input frequency of the PLL
 *  @return	Nothing
 *  @note	Unlike the Chip_Clock_SetupSystemPLLPrec() function, this
 *  function does not disable or enable PLL power, wait for PLL lock,
 *  or adjust system voltages. These must be done in the application.
 *  The function will not alter any source clocks (ie, main systen clock)
 *  that may use the PLL, so these should be setup prior to and after
 *  exiting the function.
 */
void CLOCK_SetupSystemPLLMult(uint32_t multiply_by, uint32_t input_freq);

#if defined(__cplusplus)
}
#endif /* __cplusplus */

/*! @} */

#endif /* _FSL_CLOCK_H_ */
